print("This is the solution to task 3 to lesson 2")
month = int(input('Введите целое число от 1 до 12: '))
print("-------------------------------------------------------------------------------------")
print('Решение через "list"')
my_list = ("к зиме", "к зиме", "к весне", "к весне", "к весне", "к лету", "к лету", "к лету", "к осени", "к осени", "к осени",
            "к зиме")
print(f'Месяц № {month} относится к {my_list[month-1]}')
print("-------------------------------------------------------------------------------------")
print('Решение через "dict"')
my_dict = {1: 'зиме', 2: 'зиме', 3: 'весне', 4: 'весне', 5: 'весне', 6: 'лету',
           7: 'лету', 8: 'лету', 9: 'осени', 10: 'осени', 11: 'осени', 12: 'зиме'}
print(f'Месяц № {month} относится к {my_dict.get(month)}')
